results/spring-quarkus-perf-comparison/2026-03-10_12-09-04/wrk-spring3-jvm-0.log
Running 30s test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.04ms   16.38ms 455.08ms   92.52%
    Req/Sec   7664.00   1193.63  9631.00     76.67
  229920 requests in 30.029s, 185.42MB read
Requests/sec: 7656.60
Transfer/sec:   6.17MB