results/spring-quarkus-perf-comparison/2026-03-10_12-09-04/wrk-warmup-quarkus3-jvm-1.log
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.17ms    6.44ms 174.06ms   87.17%
    Req/Sec   16055.23   4781.27  19201.00     80.17
  1942683 requests in 120.008s,   1.46GB read
Requests/sec: 16187.95
Transfer/sec:  12.44MB