results/spring-quarkus-perf-comparison/2026-03-10_12-09-04/wrk-warmup-spring4-virtual-2.log
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.11ms    8.91ms 595.59ms   93.94%
    Req/Sec   14059.13   3292.04  15438.00     90.00
  1687096 requests in 120.02s,   1.33GB read
Requests/sec: 14056.79
Transfer/sec:  11.34MB